### Obteniendo estadisticos utilizando SQL desde Python

#### 1. Trabajamos con SQL

In [5]:
import pyodbc
import pandas as pd

In [3]:
#Creamos una variable donde guardamos los datos de conexion del servidor SQL
server ="DESKTOP-GU4H9H0\SQLEXPRESS"

In [4]:
conexion =pyodbc.connect(driver='{SQL Server}', host =server, database = "DB_PYTHON")
print("conexion exitosa")

conexion exitosa

In [10]:
suma=pd.read_sql("SELECT SUM(Tiempo) FROM MaratonNY_Python", conexion)

C:\Users\pc\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [7]:
cantidades=pd.read_sql("SELECT COUNT(Tiempo) FROM MaratonNY_Python", conexion)

C:\Users\pc\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [8]:
minimo=pd.read_sql("SELECT MIN(Tiempo) FROM MaratonNY_Python", conexion)

C:\Users\pc\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [9]:
maximo=pd.read_sql("SELECT MAX(Tiempo) FROM MaratonNY_Python", conexion)

C:\Users\pc\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [11]:
promedio=pd.read_sql("SELECT AVG(Tiempo) FROM MaratonNY_Python", conexion)

C:\Users\pc\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [12]:
paises=pd.read_sql("SELECT DISTINCT(Pais) FROM MaratonNY_Python", conexion)

C:\Users\pc\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [13]:
cantidad_paises=pd.read_sql("SELECT COUNT(DISTINCT(Pais)) FROM MaratonNY_Python", conexion)

C:\Users\pc\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [14]:
conexion.close()

#### 2. Trabajamos con el dataframe

In [15]:
suma

0  268570.7

In [16]:
minimo

0  147.333333

In [17]:
maximo

0  566.783333

In [18]:
promedio

0  268.5707

In [19]:
paises

   Pais
0    AK
1   ARG
2   AUS
3   AUT
4    AZ
..  ...
67   VA
68  VEN
69   VT
70   WA
71   WI

[72 rows x 1 columns]

In [20]:
cantidad_paises

0  72

#### 3. Accedemos a los valores del dataframe con loc e iloc

In [21]:
minimo.iloc[0][0]

147.3333333

In [22]:
round(minimo.iloc[0][0], 2) #redondeo de la cantidad, con dos decimales

147.33

In [24]:
print (f'La suma de los tiempos es {round(suma.iloc[0][0], 2)}')
print (f'La cantidad de los tiempos es {round(cantidades.iloc[0][0], 2)}')
print (f'El tiempo minimo es {round(minimo.iloc[0][0], 2)}')
print (f'El tiempo maximo es {round(maximo.iloc[0][0], 2)}')
print (f'El tiempo promedio es {round(promedio.iloc[0][0], 2)}')

salto='\n'

print (f'La lista de paises que particicpan en la maraton es{salto}{paises}')
print (f'Que viene a ser un total de {round(cantidad_paises.iloc[0][0], 2)} paises')

La suma de los tiempos es 268570.7
La cantidad de los tiempos es 1000
El tiempo minimo es 147.33
El tiempo maximo es 566.78
El tiempo promedio es 268.57
La lista de paises que particicpan en la maraton es
   Pais
0    AK
1   ARG
2   AUS
3   AUT
4    AZ
..  ...
67   VA
68  VEN
69   VT
70   WA
71   WI

[72 rows x 1 columns]
Que viene a ser un total de 72 paises